app/views/articles/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
      <td style="overflow: hidden; text-overflow: ellipsis; max-width: 70%;"><%= article.title  %></td>
      <td><h6 class="text-capitalize mx-4"><%= article.user.first_name %> || <%= article.created_at.to_date %> || Member Only <i class="fa fa-star" aria-hidden="true"></i></h6></td>