app/helpers/likes_helper.rb

  def content_liked(likeableid, likeabletype)
    Like.find_by(likeable_id: likeableid, likeable_type: likeabletype, user_id: current_user.id)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2 AND "likes"."user_id" = $3 LIMIT $4  [["likeable_id", 1], ["likeable_type", "Article"], ["user_id", 6], ["LIMIT", 1]]