app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @article = Article.includes(comments: :replies).find(params[:id])

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "articles" SET "updated_at" = $1 WHERE "articles"."id" = $2  [["updated_at", "2024-03-24 09:11:47.906657"], ["id", 4]]
---
  def create
    @article = Article.create(article_params)
    authorize @article
    #if article saved
    if @article.save

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
  def destroy
    flash[:notice] = t(:article_deleted) if @article.destroy