app/controllers/comments_controller.rb

  def create
    authorize Comment
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("comment_body", "article_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_body", "enbddddddddddddddddddddddddddd"], ["article_id", 1], ["user_id", 7], ["created_at", "2024-04-21 15:16:56.035699"], ["updated_at", "2024-04-21 15:16:56.035699"]]