app/controllers/likes_controller.rb

  def create
    @like = @likeable.likes.new(user_id: current_user.id)
    flash[:notice] = if @like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Article"], ["likeable_id", 2], ["user_id", 6], ["created_at", "2024-03-24 08:52:08.821564"], ["updated_at", "2024-03-24 08:52:08.821564"]]

  def destroy
    @like = Like.find(params[:id])
    authorize @like
    flash[:notice] = if @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]

  def set_likes
    @likeable = if params[:article_id]
                  Article.find(params[:article_id])
                elsif params[:comment_id]
                  Comment.find(params[:comment_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]