app/controllers/suggestions_controller.rb

  def create
    authorize Suggestion
    @article = Article.find(params[:article_id])
    @suggestion = @article.suggestions.create(suggest_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "suggestions" ("suggest", "user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["suggest", "hsdddddhdhdhsggggggggggggsaaaaaaaaa"], ["user_id", 7], ["article_id", 1], ["created_at", "2024-04-21 15:16:16.015673"], ["updated_at", "2024-04-21 15:16:16.015673"]]

  def destroy
    authorize Suggestion
    @suggestion = Suggestion.find(params[:id])
    flash[:notice] = if @suggestion.destroy
---
SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "suggestions" WHERE "suggestions"."id" = $1  [["id", 3]]