app/views/suggestions/_suggestion.html.erb

<p>
  <strong><%= suggestion.user.first_name %>:</strong>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]