app/views/suggestions/index.html.erb

      <td style="overflow: hidden; text-overflow: ellipsis; max-width: 70%;"><%= suggestion.suggest  %></td>
      <td><h6 class="text-capitalize mx-4"><%= suggestion.user.first_name %> </h6></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]