app/views/reports/_comment_report.html.erb

<% if user_signed_in? && current_user.reports.find_by(reportable_id: comment.id, reportable_type: 'Comment') %>
---
SELECT  "reports".* FROM "reports" WHERE "reports"."user_id" = $1 AND "reports"."reportable_id" = $2 AND "reports"."reportable_type" = $3 LIMIT $4  [["user_id", 7], ["reportable_id", 1], ["reportable_type", "Comment"], ["LIMIT", 1]]