app/views/reports/_form.html.erb

<% if user_signed_in? && current_user.reports.find_by(reportable_id: @article.id, reportable_type: 'Article') %>
---
SELECT  "reports".* FROM "reports" WHERE "reports"."user_id" = $1 AND "reports"."reportable_id" = $2 AND "reports"."reportable_type" = $3 LIMIT $4  [["user_id", 6], ["reportable_id", 1], ["reportable_type", "Article"], ["LIMIT", 1]]